import React from 'react';
import './style.css'

const AdvantageCard = ({ imgSrc, title, description }) => {
  return (
    <div className="featured-card">
      <img src={imgSrc} alt={title} />
      <h4>{title}</h4>
      <p>{description}</p>
    </div>
  );
};

const Advanture = () => {
  return (
    <div>
      <div className="advantage">
        <h2>Մեր առավելությունները</h2>
      </div>
      <div className="cont6">
        <div>
          <AdvantageCard
            imgSrc="https://healthyfood.am/v2/wp-content/uploads/2022/12/icon-1.svg"
            title="Նիհարել"
            description="Մենք առաջարկում ենք հինգանգամյա սննդակարգ, որը ներառում է 6-8 ուտեստներ, իսկ ուտեստներից մեկն անշաքար քաղցրավենիք է: Ամեն օր Դուք ստանում եք ողջ օրվա սննդակարգը պայուսակ-սառնարանով։ Հարմարավետության համար ներառում ենք երկու լիտր ջուր։ Բոլոր տարրաները համարակալված են, իսկ ուտեստները ժամերով ներկայացված են հաճախորդի մենյու-թերթիկում։"
          />
        </div>

        <div>
          <AdvantageCard
            imgSrc="https://healthyfood.am/v2/wp-content/uploads/2022/12/icon-2.svg"
            title="Մեր ծրագրերը"
            description="Մեր ծրագրերը մշակվել են Իսրայելի և Ռուսաստանի լավագույն դիետոլոգների կողմից: Ծրագրի ողջ ընթացքը վերահսկվում է բժիշկ-սննդաբանի կողմից: Ծրագրերը լիովին բալանսավորված են, այսինքն պարունակում են Ձեր պարամետրերին համապատասխան սպիտակուցների, ճարպերի, ածխաջրերի քանակ, ինչպես նաև բջջանյութ, վիտամիններ և միկրոտարրեր."
          />
        </div>

        <div>
          <AdvantageCard
            imgSrc="https://healthyfood.am/v2/wp-content/uploads/2022/12/icon-3.svg"
            title="Վճարման համակարգ և տարբերակներ"
            description="Healthy box ընկերությունը սահմանել է զեղչերի հստակ համակարգ բոլոր այն հաճախորդների համար, ովքեր պատրաստվում են ավելի երկար օգտվել ընկերության ծառայություններից: Ծրագրի տևողությունից կախված արժեքը նվազում է։ Վճարել կարելի է կանխիկ՝ առաքման առաջին օրը, բանկային փոխանցումով մեր հաշվե համարի կամ քարտային հաշվին, ինչպես նաև կայքի միջոցով կամ Idram համակարգով։"
          />
        </div>

        <div>
          <AdvantageCard
            imgSrc="https://healthyfood.am/v2/wp-content/uploads/2022/12/icon-4.svg"
            title="Առաքում"
            description="Մեր առաքման ժամերն են՝ ամեն օր առավոտյան 7:00-11:00-ը: Պատվերը կարող եք գրանցել առցանց կամ զանգահարել առաքման ժամից 24 ժամ առաջ: Մեր գրասենյակը աշխատում է ամեն օր 9:00-19:00-ը, որի ընթացքում մեր խորհրդատուները սիրով կպատասխանեն Ձեր ցանկացած հարցին և/կամ կգրանցեն Ձեր պատվերը։"
          />
        </div>

        <div>
          <AdvantageCard
            imgSrc="https://healthyfood.am/v2/wp-content/uploads/2022/12/icon-5.svg"
            title="Խնայել ժամանակը"
            description="Մեզ հետ դուք կխնայեք ժամանակ։ Մենք անում ենք ամեն ինչ, որպեսզի զբաղված մարդիկ կարողանան համեղ և գրագետ սնվել: Մենք կխնայենք ձեր ժամանակը և դուք կկարողանաք կենտրոնանալ Ձեր աշխատանքի վրա, ավելի շատ ժամանակ հատկացնել Ձեր ընտանիքին, ընկերներին։"
          />
        </div>

        <div>
          <AdvantageCard
            imgSrc="https://healthyfood.am/v2/wp-content/uploads/2022/12/icon-2.svg"
            title="Մենք 10 տարեկան ենք"
            description="Healthy box ընկերությունը հիմնվել է Հայաստանում 2013 թ-ին։ Արդեն 10 տարի է մենք ամեն օր առաքում ենք անակնկալ պայուսակները մեր սիրելի հաճախորներին և օգնում նրանց հասնել իրենց նպատակին։ «Նիհարում ենք ուտելով»-ը մեր կարգախոսն է և մեր ողջ թիմը՝ զօր ու գիշեր աշխատելով, փորձում է լավագույնը և ամենահամեղը հասցնել հաճախորդներին։"
          />
        </div>
      </div>
    </div>
  );
};

export default Advanture;
